``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.beacon-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "beacon-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_beacon.galaxyproject.eu_A"
        name            = "beacon.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.18",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.beacon-import-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "beacon-import-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_beacon-import.galaxyproject.eu_A"
        name            = "beacon-import.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.173",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.zfs2f-galaxyproject will be created
  + resource "aws_route53_record" "zfs2f-galaxyproject" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "zfs2f.galaxyproject.eu"
      + records         = [
          + "10.5.68.236",
        ]
      + ttl             = 7200
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_compute_instance_v2.beacon must be replaced
-/+ resource "openstack_compute_instance_v2" "beacon" {
      ~ access_ip_v4        = "10.5.68.18" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "340b8b5a-4bd2-4341-bd75-e15251c9ae11" -> (known after apply)
      ~ id                  = "e57d25a5-630c-4e5a-ba67-8c6efde66354" -> (known after apply)
      ~ image_id            = "878a687a-fe52-41eb-9012-45010314c790" -> "c6906a58-1e05-4be0-8f20-41f24c8320b5" # forces replacement
      ~ image_name          = "generic-rockylinux8-v60-j168-5333625af7b2-main" -> (known after apply)
        name                = "beacon.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.5.68.18" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:47:11:f0" -> (known after apply)
            name           = "bioinf"
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.beacon-import must be replaced
-/+ resource "openstack_compute_instance_v2" "beacon-import" {
      ~ access_ip_v4        = "10.5.68.173" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "47d55447-e763-4e8e-9601-b94cfd7be63d" -> (known after apply)
      ~ id                  = "7ff56399-7efa-44c0-9faa-0cc8f20c461e" -> (known after apply)
      ~ image_id            = "878a687a-fe52-41eb-9012-45010314c790" -> "c6906a58-1e05-4be0-8f20-41f24c8320b5" # forces replacement
      ~ image_name          = "generic-rockylinux8-v60-j168-5333625af7b2-main" -> (known after apply)
        name                = "beacon-import.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.5.68.173" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:dc:72:85" -> (known after apply)
            name           = "bioinf"
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.dev will be created
  + resource "openstack_compute_instance_v2" "dev" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "Dedicated development VM"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "37ed09c9e2a29840be56dee2e571c245d058b719"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "6395218e-b418-41c1-a502-ceb54c1f12cc"
          + volume_size           = 500
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.beacon-va must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "beacon-va" {
      ~ device      = "/dev/vdb" -> (known after apply)
      ~ id          = "e57d25a5-630c-4e5a-ba67-8c6efde66354/e0a79fc1-897e-49da-b7bb-44a13ad9984e" -> (known after apply)
      ~ instance_id = "e57d25a5-630c-4e5a-ba67-8c6efde66354" -> (known after apply) # forces replacement
      ~ region      = "Freiburg" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```